In [22]:
import pandas as pd
import numpy as np
# create data
stuff={
    "Corporation":['Appple','Google','Meta','Apple','Google','Meta'],
    "Employee":['Jhon','April','wES',"seth",'Justin','steph'],
    "Salary":['200','230','120','150','190','130']
}
df=pd.DataFrame(stuff)
df

  Corporation Employee Salary
0      Appple     Jhon    200
1      Google    April    230
2        Meta      wES    120
3       Apple     seth    150
4      Google   Justin    190
5        Meta    steph    130

In [23]:
# Create Function
def times10(x):
    return x*10

In [24]:
# use apply  Funtion
df["Salary"].apply(times10)

0    200200200200200200200200200200
1    230230230230230230230230230230
2    120120120120120120120120120120
3    150150150150150150150150150150
4    190190190190190190190190190190
5    130130130130130130130130130130
Name: Salary, dtype: object

In [25]:
#Make it into a dataframe
pd.DataFrame(df["Salary"].apply(times10))

                           Salary
0  200200200200200200200200200200
1  230230230230230230230230230230
2  120120120120120120120120120120
3  150150150150150150150150150150
4  190190190190190190190190190190
5  130130130130130130130130130130

In [26]:
#Add Elder lastNmae
def namer(x):
    if x == "Jhon":
        return "Jhon Elder"
    else:
        return x

In [27]:
#Show eler last Name
df["Employee"].apply(namer)

0    Jhon Elder
1         April
2           wES
3          seth
4        Justin
5         steph
Name: Employee, dtype: object

In [28]:
#uSE LAMDA
pd.DataFrame(df["Salary"].apply(lambda x:format(x*1000)))

                                              Salary
0  2002002002002002002002002002002002002002002002...
1  2302302302302302302302302302302302302302302302...
2  1201201201201201201201201201201201201201201201...
3  1501501501501501501501501501501501501501501501...
4  1901901901901901901901901901901901901901901901...
5  1301301301301301301301301301301301301301301301...

In [29]:
# Apply functions to mutiple volumns

# Append to current Df
df["Salary"]=df["Salary"].apply(times10)
df

  Corporation Employee                          Salary
0      Appple     Jhon  200200200200200200200200200200
1      Google    April  230230230230230230230230230230
2        Meta      wES  120120120120120120120120120120
3       Apple     seth  150150150150150150150150150150
4      Google   Justin  190190190190190190190190190190
5        Meta    steph  130130130130130130130130130130

In [30]:
# fUNTION ON MUTIPLE COLUMS
def namer(x):
    return "project:"+x

In [31]:
#Apply to two colums
df[["Corporation","Employee"]].apply(namer)

      Corporation        Employee
0  project:Appple    project:Jhon
1  project:Google   project:April
2    project:Meta     project:wES
3   project:Apple    project:seth
4  project:Google  project:Justin
5    project:Meta   project:steph

In [32]:
#Append to current DATAFRAME
df[["Corporation","Employee"]]=df[["Corporation","Employee"]].apply(namer)
df

      Corporation        Employee                          Salary
0  project:Appple    project:Jhon  200200200200200200200200200200
1  project:Google   project:April  230230230230230230230230230230
2    project:Meta     project:wES  120120120120120120120120120120
3   project:Apple    project:seth  150150150150150150150150150150
4  project:Google  project:Justin  190190190190190190190190190190
5    project:Meta   project:steph  130130130130130130130130130130